In [ ]:
!pip install kaggle

In [2]:
import kaggle

In [ ]:
# download from keggle
!kaggle datasets download ankitbansal06/retail-orders -f orders.csv

Dataset URL: https://www.kaggle.com/datasets/ankitbansal06/retail-orders
License(s): CC0-1.0
Downloading orders.csv.zip to f:\python

  0%|          | 0.00/200k [00:00<?, ?B/s]
100%|██████████| 200k/200k [00:00<00:00, 225kB/s]
100%|██████████| 200k/200k [00:00<00:00, 225kB/s]

In [6]:
# unzip file
import zipfile

unzip_file = zipfile.ZipFile("orders.csv.zip")
unzip_file.extractall()
unzip_file.close()

In [21]:
import pandas as pd

In [47]:
# import data from drive
order_data = pd.read_csv("orders.csv")
order_data.head(5)

,Order Id,Order Date,Ship Mode,Segment,Country,City,State,Postal Code,Region,Category,Sub Category,Product Id,cost price,List Price,Quantity,Discount Percent
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,240,260,2,2
1,2,2023-08-15,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Chairs,FUR-CH-10000454,600,730,3,3
2,3,2023-01-10,Second Class,Corporate,United States,Los Angeles,California,90036,West,Office Supplies,Labels,OFF-LA-10000240,10,10,2,5
3,4,2022-06-18,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Furniture,Tables,FUR-TA-10000577,780,960,5,2
4,5,2022-07-13,Standard Class,Consumer,United States,Fort Lauderdale,Florida,33311,South,Office Supplies,Storage,OFF-ST-10000760,20,20,2,5

In [48]:
order_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 16 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order Id          9994 non-null   int64
 1   Order Date        9994 non-null   object
 2   Ship Mode         9993 non-null   object
 3   Segment           9994 non-null   object
 4   Country           9994 non-null   object
 5   City              9994 non-null   object
 6   State             9994 non-null   object
 7   Postal Code       9994 non-null   int64
 8   Region            9994 non-null   object
 9   Category          9994 non-null   object
 10  Sub Category      9994 non-null   object
 11  Product Id        9994 non-null   object
 12  cost price        9994 non-null   int64
 13  List Price        9994 non-null   int64
 14  Quantity          9994 non-null   int64
 15  Discount Percent  9994 non-null   int64
dtypes: int64(6), object(10)
memory usage: 1.2+ MB

In [49]:
order_data.columns

Index(['Order Id', 'Order Date', 'Ship Mode', 'Segment', 'Country', 'City',
       'State', 'Postal Code', 'Region', 'Category', 'Sub Category',
       'Product Id', 'cost price', 'List Price', 'Quantity',
       'Discount Percent'],
      dtype='object')

In [50]:
# change column name 
order_data.columns = order_data.columns.str.lower()
order_data.columns = order_data.columns.str.replace(" ","_")
order_data.columns

Index(['order_id', 'order_date', 'ship_mode', 'segment', 'country', 'city',
       'state', 'postal_code', 'region', 'category', 'sub_category',
       'product_id', 'cost_price', 'list_price', 'quantity',
       'discount_percent'],
      dtype='object')

In [51]:
# change order_date datatype
order_data["order_date"]=pd.to_datetime(order_data["order_date"],format="%Y-%m-%d")

In [52]:
# find null value
order_data["ship_mode"].unique()

array(['Second Class', 'Standard Class', 'Not Available', 'unknown',
       'First Class', nan, 'Same Day'], dtype=object)

In [ ]:
import numpy as np
order_data["ship_mode"].replace(['Not Available', 'unknown'],np.nan,inplace=True)

In [55]:
order_data["ship_mode"].unique()

array(['Second Class', 'Standard Class', nan, 'First Class', 'Same Day'],
      dtype=object)

In [56]:
# create discount price column
order_data["discount"] = order_data["list_price"]*order_data["discount_percent"]/100

In [58]:
order_data.head(1)

,order_id,order_date,ship_mode,segment,country,city,state,postal_code,region,category,sub_category,product_id,cost_price,list_price,quantity,discount_percent,discount
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,240,260,2,2,5.2

In [59]:
# create sale price column
order_data["sale_price"] = order_data["list_price"]- order_data["discount"]

In [60]:
# create profite column
order_data["profite"] = order_data["cost_price"]-order_data["sale_price"]

In [61]:
order_data.head(1)

,order_id,order_date,ship_mode,segment,country,city,state,postal_code,region,category,sub_category,product_id,cost_price,list_price,quantity,discount_percent,discount,sale_price,profite
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,240,260,2,2,5.2,254.8,-14.8

In [62]:
# now delete unusefull column
order_data.drop(columns=["cost_price","discount_percent","list_price"],inplace=True)

In [80]:
# upload this in my sql for analysis
import sqlalchemy as sal
engine = sal.create_engine("mysql+mysqlconnector://root:Alpesh%402310@localhost:3307/order_data_project")
conn=engine.connect()

order_data.to_sql("order_data",con=conn,index=False,if_exists="append")

-1

In [84]:
order_d = pd.read_sql("select * from order_data limit 1",conn)
order_d

,order_id,order_date,ship_mode,segment,country,city,state,postal_code,region,category,sub_category,product_id,quantity,discount,sale_price,profite
0,1,2023-03-01,Second Class,Consumer,United States,Henderson,Kentucky,42420,South,Furniture,Bookcases,FUR-BO-10001798,2,5.2,254.8,-14.8

In [86]:
#find top 10 highest reveue generating products

high_revenue = pd.read_sql("""SELECT product_id, SUM(sale_price) AS sales 
                           FROM 
                           order_data 
                           GROUP BY product_id 
                           ORDER BY sales DESC 
                           LIMIT 10 """,conn)
high_revenue

        product_id    sales
0  TEC-CO-10004722  59514.0
1  OFF-BI-10003527  26525.3
2  TEC-MA-10002412  21734.4
3  FUR-CH-10002024  21096.2
4  OFF-BI-10001359  19090.2
5  OFF-BI-10000545  18249.0
6  TEC-CO-10001449  18151.2
7  TEC-MA-10001127  17906.4
8  OFF-BI-10004995  17354.8
9  OFF-SU-10000151  16325.8

In [91]:
#find top 5 highest selling products in each region

region = pd.read_sql("""WITH new_1 AS 
                     (SELECT region, product_id, SUM(sale_price) AS sales 
                     FROM 
                     order_data
                     GROUP BY region, product_id)
                     SELECT * FROM 
                     (SELECT region, product_id, sales,
                     ROW_NUMBER() OVER (PARTITION BY region ORDER BY sales DESC) AS ran
                     FROM new_1) t 
                     WHERE ran <= 5""",conn)

region

     region       product_id    sales  ran
0   Central  TEC-CO-10004722  16975.0    1
1   Central  TEC-MA-10000822  13770.0    2
2   Central  OFF-BI-10001120  11056.5    3
3   Central  OFF-BI-10000545  10132.7    4
4   Central  OFF-BI-10004995   8416.1    5
5      East  TEC-CO-10004722  29099.0    1
6      East  TEC-MA-10001047  13767.0    2
7      East  FUR-BO-10004834  11274.1    3
8      East  OFF-BI-10001359   8463.6    4
9      East  TEC-CO-10001449   8316.0    5
10    South  TEC-MA-10002412  21734.4    1
11    South  TEC-MA-10001127  11116.4    2
12    South  OFF-BI-10001359   8053.2    3
13    South  TEC-MA-10004125   7840.0    4
14    South  OFF-BI-10003527   7391.4    5
15     West  TEC-CO-10004722  13440.0    1
16     West  OFF-SU-10000151  12592.3    2
17     West  FUR-CH-10001215   9604.0    3
18     West  OFF-BI-10003527   7804.8    4
19     West  TEC-AC-10003832   7722.7    5

In [93]:
# find month over month growth comparison for 2022 and 2023 sales
query = """With month_over_month_growth as 
        (Select year(order_date) as O_year , month(order_date),monthname(order_date) as O_month ,
        sum(sale_price) as sales 
        From 
        order_data
        Group by year(order_date), month(order_date),monthname(order_date)
        Order by  year(order_date), month(order_date))
        
        Select O_month,
        round(sum(case when O_year = 2022 then sales else 0 end),2) as y_2022,
        round(sum(case when O_year = 2023 then sales else 0 end),2) as y_2023
        From 
        month_over_month_growth
        Group by O_month;"""
        
m_o_m_g = pd.read_sql(query,conn)      
m_o_m_g

      O_month    y_2022    y_2023
0     January   94712.5   88632.6
1    February   90091.0  128124.2
2       March   80106.0   82512.3
3       April   95451.6  111568.6
4         May   79448.3   86447.9
5        June   94170.5   68976.5
6        July   78652.2   90563.8
7      August  104808.0   87733.6
8   September   79142.2   76658.6
9     October  118912.7  121061.5
10   November   84225.3   75432.8
11   December   95869.9  102556.1

In [95]:
# for each category which month had highest sales 

query_c = """With cate as 
            (Select category,month(order_date),monthname(order_date) as month_n,sum(sale_price) as sales
            From 
            order_data
            Group by category,month(order_date),monthname(order_date)
            Order by category,month(order_date) )
            
            Select category,month_n,sales 
            From 
            (Select * ,
            row_number() over (partition by category order by sales desc) as r
            From cate) 
            t
            Where r = 1"""
           
cate = pd.read_sql(query_c,conn) 
cate

          category   month_n     sales
0        Furniture    August   71649.5
1  Office Supplies  February   77959.5
2       Technology   October  103021.1

In [99]:
# which sub category had highest growth by profit in 2023 compare to 2022

query_subc = """With subcat as 
            (Select sub_category,year(order_date) as O_year ,sum(sale_price) as sales 
            From 
            order_data
            Group by sub_category,year(order_date)
            Order by sub_category, year(order_date) )
            
            Select * ,round((y_2023 - y_2022),2) as y23_22 
            From 
            (Select sub_category,
            round(sum(case when O_year = 2022 then sales else 0 end),2) as y_2022,
            round(sum(case when O_year = 2023 then sales else 0 end),2) as y_2023
            From 
            subcat
            Group by sub_category) t
            Order by (y_2023 - y_2022) desc"""
            
y23vsy22  = pd.read_sql(query_subc,conn)      
y23vsy22

   sub_category    y_2022    y_2023   y23_22
0      Machines   73723.2  109178.5  35455.3
1       Binders   87675.5  108363.1  20687.6
2        Chairs  151395.3  165429.8  14034.5
3      Supplies   16140.7   28917.4  12776.7
4       Storage  102907.4  113000.6  10093.2
5   Accessories   77627.2   83977.4   6350.2
6     Bookcases   53469.5   57346.6   3877.1
7        Phones  157334.7  160673.6   3338.9
8     Fasteners    1430.1    1508.8     78.7
9        Labels    6329.6    5665.3   -664.3
10          Art   13644.1   12615.7  -1028.4
11    Envelopes    8767.2    7150.0  -1617.2
12        Paper   38898.9   36932.4  -1966.5
13  Furnishings   47816.2   40522.1  -7294.1
14      Copiers   82090.3   62268.6 -19821.7
15       Tables  111305.9   88055.3 -23250.6
16   Appliances   65034.4   38663.3 -26371.1